![Alt text](../../../Desktop/%ED%99%94%EB%A9%B4%20%EC%BA%A1%EC%B2%98%202023-05-26%20160131.png)

In [1]:
import pandas as pd

In [14]:
#DataFrame을 만들때 딕셔너리는 ""열""의 단위로 만들어진다
dict_data = {'x':[1,2,3],'y':[4,5,6],'z':[7,8,9]}

In [15]:
df=pd.DataFrame(dict_data)

In [16]:
df

   x  y  z
0  1  4  7
1  2  5  8
2  3  6  9

In [7]:
type(df)

pandas.core.frame.DataFrame

In [12]:
#DataFrame은 동일한 갯수의 데이터가 여러개로 만들어짐.
#DataFrame은 리스트 중첩형태로도 만들수 있는데, 이때 ""행으로 만들어진다"


df2 = pd.DataFrame([[11,22,33],[44,55,66],[77,88,99]])
df2

    0   1   2
0  11  22  33
1  44  55  66
2  77  88  99

In [18]:
df3 = pd.DataFrame([[11,22,33],[44,55,66],[77,88,99]],
                   index = ['종목1','종목2','종목3'],
                   columns=['가격1','가격2','가격3'])
df3

     가격1  가격2  가격3
종목1   11   22   33
종목2   44   55   66
종목3   77   88   99

In [19]:
#df3에 저장된 종목1 인덱스를 날짜로 변경하라
df3.index=['5월22일','5월23일','5월24일']
df3

       가격1  가격2  가격3
5월22일   11   22   33
5월23일   44   55   66
5월24일   77   88   99

In [20]:
#df3에 저장된 가격1을 수량1로 변경하라
df3.columns=['수량1','수량2','수량3']
df3

       수량1  수량2  수량3
5월22일   11   22   33
5월23일   44   55   66
5월24일   77   88   99

In [23]:
#df3 지정된 행의 이름을 변경 "inplace = True"를 넣으면 원본 데이터를 변경한다.
df3.rename(index = {'5월22일':'4월5일'},inplace=True)
df3

       수량1  수량2  수량3
4월5일    11   22   33
5월23일   44   55   66
5월24일   77   88   99

In [24]:
#df3 지정된 열의 이름을 변경 "inplace = True"를 넣으면 원본 데이터를 변경한다.
df3.rename(columns= {'수량2':'수량7'},inplace=True)
df3

       수량1  수량7  수량3
4월5일    11   22   33
5월23일   44   55   66
5월24일   77   88   99

In [27]:
#df3 행이나 열을 삭제, 행삭제시 axis에 0을 입력
df3.drop('4월5일',axis=0,inplace=True)
df3

       수량1  수량7  수량3
5월23일   44   55   66
5월24일   77   88   99

In [28]:
#df3 행이나 열을 삭제, 열삭제시 axis에 1을 입력
df3.drop('수량7',axis=1,inplace=True)
df3

       수량1  수량3
5월23일   44   66
5월24일   77   99

In [29]:
dict_data = {'col1':[1,2,3,4],'col2':[5,6,7,8],
             'col3':[9,10,11,12],'col4':[13,14,15,16]}
df = pd.DataFrame(dict_data, index=['index1','index2','index3','index4'])
df

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15
index4     4     8    12    16

In [31]:
df['col3']

index1     9
index2    10
index3    11
index4    12
Name: col3, dtype: int64

In [35]:
#하나의 열만 선택하면 type은 시리즈이다, 
type(df.col1)

pandas.core.series.Series

In [36]:
#데이터프레임으로 타입을 반환하고 싶을 경우에는 
#이중대괄호형태로 입력하면 된다.
df[['col1']]

        col1
index1     1
index2     2
index3     3
index4     4

In [37]:
type(df[['col1']])

pandas.core.frame.DataFrame

In [39]:
df[['col1','col2']]

        col1  col2
index1     1     5
index2     2     6
index3     3     7
index4     4     8

In [40]:
#파이썬에서 행 데이터를 선택할 때 loc과 iloc 인덱서를 사용합니다
#loc: 인덱스 이름을 기준으로 행을 선택할 때
#iloc: 위치 인덱스를 기준으로 행을 선택할 때

df.loc['index1']

col1     1
col2     5
col3     9
col4    13
Name: index1, dtype: int64

In [41]:
#2번째행의 값을 출력
df.iloc[1]

col1     2
col2     6
col3    10
col4    14
Name: index2, dtype: int64

In [42]:
df

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15
index4     4     8    12    16

In [43]:
# 행을 한개만 선택할때에도 시리즈 객체가 반환된다. 그래서 이중괄호 쓰라
df.loc[['index1']]

        col1  col2  col3  col4
index1     1     5     9    13

In [44]:
type(df.loc[['index1']])

pandas.core.frame.DataFrame

In [53]:
#슬라이싱 기능도 사용이 가능하다.
#df.loc['index2':'index4']
df.loc['index1':'index3']

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15

In [51]:
# loc : 인덱스 이름사용/ 범위의 끝 포함
# iloc : 위치 인덱스 사용/ 범위의 끝은 제외한다!
df.iloc[0:2]

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14

In [54]:
df

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15
index4     4     8    12    16

In [55]:
#<행과 열 선택>
#DataFrame.loc['행 인덱스','열 이름']
#DataFrame.iloc['행 위치, 열위치]
df.loc['index1','col3']

9

In [60]:
df.loc[['index1','index3'],['col1','col4']]

        col1  col4
index1     1    13
index3     3    15

In [58]:
df.iloc[0,0]

1

In [59]:
df.iloc[[0,2],[0,3]]

        col1  col4
index1     1    13
index3     3    15

In [61]:
df

        col1  col2  col3  col4
index1     1     5     9    13
index2     2     6    10    14
index3     3     7    11    15
index4     4     8    12    16

In [65]:
df.iloc[[1,2],[2,3]]

        col3  col4
index2    10    14
index3    11    15

In [66]:
df.iloc[0:2,0:3] #iloc의 경우 범위의 끝이 포함되지 않는다

        col1  col2  col3
index1     1     5     9
index2     2     6    10